#### **Merge İşlemleri**

# ![title](merge1.png)

Elimizde birden fazla dataframe olduğu durumlarda bunları tek bir Dataframe gibi düşünüp işlem yapmak istediğimizde ise datalar üzerinde birleştirme işlemi yaparız.

Merge komutu ile yapılan işlemleri SQL'de kullanılan join işlemlerine benzetebiliriz.

In [29]:
import pandas as pd

df_sales = pd.read_csv(r"..\Data\merge\sales.csv")
df_sales.head()

   SalesID  SalesPersonID  CustomerID  ProductID  Quantity
0        4              1        4182        437       437
1        9              1           1          1        10
2       20              1        4182        437       437
3       25              1           1          1        26
4       33              1       13482         26       530

In [32]:
df_product = pd.read_csv(r"..\Data\merge\products.csv")
df_product.head()

   ProductID                   Name  Price
0          1        Adjustable Race    1.6
1          2           Bearing Ball    0.8
2          3        BB Ball Bearing    2.4
3          4  Headset Ball Bearings    0.0
4          5                  Blade  189.6

# ![title](merge2.png)

Burada önemli olan how ve on parametreleridir.

* on -> DataFrame’leri birleştirirken hangi sütunu baz alarak işlem yapacağımızı belirler. Veri setimizde ProductID sütununa göre birleştirme işlemini yapıyor olacağız.

* how -> İki dataframe birleştirilirken hangi yöntemle birleştirileceğini belirtir. SQL’de kullanılan join işlemlerine benzetebiliriz.
inner, left, right, outer

**inner join**

Her iki dataframe’de yer alan ortak değerlere göre işlem yapar.

In [35]:
df_sales.merge(df_product, how="inner", on="ProductID").head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Name,Price
0,9,1,1,1,10,Adjustable Race,1.6
1,25,1,1,1,26,Adjustable Race,1.6
2,178,1,1,1,179,Adjustable Race,1.6
3,194,1,1,1,195,Adjustable Race,1.6
4,418,1,1,1,11,Adjustable Race,1.6

**left join**

df_sales de yer alan satırların tümü alınır. df_product da karşılığı yoksa NaN olarak ifade edilir. df_sales de yer almayan df_product da yer alan satırlar yok sayılır.

In [36]:
df_sales.merge(df_product, how="left", on="ProductID").head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Name,Price
0,4,1,4182,437,437,NaN,NaN
1,9,1,1,1,10,Adjustable Race,1.6
2,20,1,4182,437,437,NaN,NaN
3,25,1,1,1,26,Adjustable Race,1.6
4,33,1,13482,26,530,Flat Washer 4,0.0

**right join**

df_product da yer alan satırların tümü alınır. df_sales de karşılığı yoksa NaN olarak ifade edilir. df_product da yer almayan df_sales de yer alan satırlar yok sayılır.

In [43]:
df_sales.merge(df_product, how="right", on="ProductID").head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Name,Price
0,9,1,1,1,10,Adjustable Race,1.6
1,25,1,1,1,26,Adjustable Race,1.6
2,178,1,1,1,179,Adjustable Race,1.6
3,194,1,1,1,195,Adjustable Race,1.6
4,418,1,1,1,11,Adjustable Race,1.6

**outer join**

df_sales de yer alan fakat df_product da yer almayan değerleri göstermek için kullanılır. df_product da yer almadığı için NaN olarak gösterilir.

In [38]:
df_sales.merge(df_product, how="outer", on="ProductID").head()

   SalesID  SalesPersonID  CustomerID  ProductID  Quantity Name  Price
0        4              1        4182        437       437  NaN    NaN
1       20              1        4182        437       437  NaN    NaN
2       87              1        4182        437       437  NaN    NaN
3      154              1        4182        437       437  NaN    NaN
4      189              1        4182        437       437  NaN    NaN